{
  "date": "12/17/2020",
  "location": "NYC",
  "name": "Caleb Curtis",
  "instrument": "Saxophone",
  "bio": [
    "Brooklyn, NY based GRAMMY nominated saxophonist Caleb Wheeler Curtis “lives at the junction of rigorous preparation and willingness to explore.” (Jazz Speaks) His playing and compositions are informed by a constant searching, at times introspective, brash and melodic. In addition to band-leading, Caleb is a core member of Walking Distance (Sunnyside Records), Orrin Evans & The Captain Black Big Band (Smoke Sessions Records), Josh Lawrence & Triptych (Posi-Tone Records), Curtis + Garabedian + Sperrazza (Outside In Music), and the Fat Cat Big Band. His upcoming album, Ain't No Storm, will be released on Imani Records this fall, 2020.",

    "Legendary pianist Mulgrew Miller said “Caleb has a wonderful, singing, projecting sound. To me, that’s the ultimate for a horn player.”His album Brothers (produced by Orrin Evans and featuring Josh Lawrence, Eric Revis, Luques Curtis, Mark Whitfield Jr. and Seamus Blake) was released in 2018 on Imani Records. All About Jazz said the music was “sharp-witted, bracing, and, at times, wonderfully brash.” Neighborhood (Ropeadope Records), the 2015 debut album from the Brooklyn based collective quartet Walking Distance, for which Caleb composes and plays alto saxophone, was met with critical acclaim. Their new album Freebird feat. Jason Moran (Sunnyside Records) has been widely praised by The New York Times, DownBeat Magazine, Bandcamp (best of September 2018), JazzTimes and others. The New York Times wrote that “[Walking Distance] tears into the new stuff it has created, sounding ageless”, that the music is “utterly fresh”, and selected it as one of the 20 best jazz recordings of 2018.",

    "Caleb holds a Bachelor's of Music (Jazz Studies) from Michigan State University, and a Master's in Music (Jazz Performance) from William Paterson University. Caleb frequently travels for international performances and also performs regularly at the Blue Note, Jazz Standard, Smalls, Smoke, Zinc Bar, Dizzy's and other NYC clubs. Caleb's individualistic approach to improvisation and sound has led to being hailed as “one of the most interesting altoists in a long time.”(Jazzwise)",

    "In addition, Caleb has played with many extraordinary musicians including Jason Moran, Mulgrew Miller, Orrin Evans, Gerald Cleaver, Duane Eubanks, Houston Person, Eric Revis, Kurt Rosenwinkel, Kevin Eubanks, Buster Williams, Lenny White, Gene Jackson, Jack Walrath, Kevin Hays, Saul Rubin, David Gibson, Lafayette Harris, Ralph Bowen, Ben Williams, Justin Brown, Sarah Elizabeth Charles, Gregorio Uribe, Ben Wolfe, Luques Curtis, Seamus Blake, Marquis Hill, Marta Sánchez, Stacy Dillard, Jon Irabagon, EJ Strickland, Matt Clohesy, Vinnie Sperrazza, Jeremy Siskind, Glenn Zaleski and many others.",

    "Caleb is a D'Addario Woodwinds Artist"
  ],
  "links": [
    {
      "text": "Caleb Curtis' website",
      "link": "https://www.calebcurtis.com/"
    },
    {
      "text": "Caleb Curtis' bandcamp",
      "link": "https://calebwheelercurtis.bandcamp.com"
    }
  ],
  "payment": {
    "venmo": "./caleb_curtis_qr.jpg",
    "paypal": ""
  },
  "charity": {
    "name": "Fair Fight",
    "bio": [
      "We promote fair elections in Georgia and around the country, encourage voter participation in elections, and educate voters about elections and their voting rights. Fair Fight brings awareness to the public on election reform, advocates for election reform at all levels, and engages in other voter education programs and communications."
    ],
    "link": "https://fairfight.com/"
  }
}
