{
  "date": "5/21/20",
  "number": 7,
  "code": "MfH8abPVeMo",
  "location": "NYC",
  "name": "Jesse Harris and Jeremy Gustin",
  "instrument": "Songs, Drums",
  "bio": [
    "Originally from New York City, Jesse Harris is a Grammy Award winning songwriter, singer, guitarist and producer of artists from all over the world. He began making records in the mid 90s with Once Blue (EMI Records), his first group and first experience writing for another singer. Since then he has worked with dozens of artists and released 15 albums under his own name. His latest album, Songs Never Sung, was released in 2019. Recorded in the tradition of the classic vocal albums, with horn arrangements by CJ Camerieri, it features jazz guitar legend Bill Frisell, drummer Kenny Wollesen and bassist Tony Scherr.",

    "In 2003 Harris received the Grammy Award for Song Of The Year for Norah Jones’ breakout hit “Don’t Know Why,” from her debut album, Come Away With Me, which has sold over 20 million copies worldwide. It includes four other of his compositions: “Shoot The Moon,” “One Flight Down,” “I’ve Got To See You Again,” and “The Long Day Is Over.” He plays guitar throughout the recording.",

    "Since then, Jones and Harris have collaborated numerous times. She has been a guest on many of his albums and he appears as guitarist on almost all of hers. He also contributed songwriting to her 2008 release The Fall and produced her version of his song “World Of Trouble” for the Ethan Hawke film The Hottest State. That soundtrack features not only Harris’ score, but new versions of his songs by Willie Nelson, Emmylou Harris, Cat Power, Feist, The Black Keys, M. Ward, Brad Mehldau, Bright Eyes (on whose album “I’m Wide Awake It’s Morning” Harris also appears as guitarist) and others. Harris and Jones appear together in the Amy Poehler/Paul Rudd comedy They Came Together, performing his song, which he also produced, “It Was The Last Thing On Your Mind.\"",

    "Other artists who have recorded Harris’ songs include Smokey Robinson, George Benson, Pat Metheny, Kandace Springs, and Solomon Burke, on whose album Like A Fire Harris plays guitar and sings backing vocals.",

    "Songwriting collaborations have included Madeleine Peyroux, Melody Gardot, Lana Del Rey, Maria Gadu, and Vinicius Cantuaria.",

    "In 2013, Harris joined John Zorn’s The Song Project, along with Mike Patton, Sofia Rei, and Sean Lennon, writing lyrics for various Zorn compositions and singing them at festivals worldwide with a band featuring Marc Ribot on guitar, John Medeski on keyboards, and Zorn conducting. Two of the group’s albums have been released by Tzadik Records. Recently, Zorn and Harris started a new project, Songs For Petra, which features Petra Haden and The Julian Lage Trio (for whom Harris has produced two albums, Arclight and Modern Lore).",

    "Cosmo, Harris’ instrumental project, features drummer Jeremy Gustin, guitarist Will Graefe, trumpeter CJ Camerieri, trombonist Mike Boschen and bassist Benjamin Lazar Davis. They perform in New York City often and are at work on their first album with producer Jason Lader.",

    "Other production credits for Harris include albums for Forro In The Dark, Sasha Dobson, and Petra Haden, who recorded an entire album of his songs, entitled “Seemed Like A Good Idea – Petra Haden Sings Jesse Harris” (Sunnyside Records). Current projects include the debut album for singer/actor Maya Hawke, the new album for experimental duo Star Rover (whom Harris has used as his backing band on several recent albums), and the debut for Parisian singer Gabi Hartmann."
  ],
  "links": [
    {
      "text": "Jesse's Website",
      "link": "http://jesseharrismusic.com/"
    },
    {
      "text": "Listen to Jesse's record, Songs Never Sung",
      "link": "https://open.spotify.com/album/3gYabl5yQx3MzHiWVB6BZX?si=b0b3gR5DTrqtwVgN3EF6gw"
    },
    {
      "text": "Listen to Jeremy's record, Mere Husk",
      "link": "https://open.spotify.com/album/74AfEkfLAPksphOCUfYUT5?si=3_hnVOdXREeQTawZJTWPTQ"
    }
  ],
  "payment": {
    "venmo": "/jesse_qr.png",
    "paypal": ""
  },
  "charity": {
    "name": "Food Bank for NYC",
    "bio": [
      "Food Bank for NYC's mission is to end hunger by organizing food, information and support for community survival, empowerment, and dignity. Food Bank For New York City has been working to end food poverty in our five boroughs for over 35 years. As the city’s largest hunger-relief organization, we employ a multifaceted approach centered on helping low-income New Yorkers overcome their circumstances and achieve greater independence."
    ],
    "link": "https://www.foodbanknyc.org/donate/"
  }
}
