{
  "date": "10-28-2020",
  "number": 30,
  "code": "8Lvwz3MAn6c",
  "location": "New York",
  "name": "Kimberly Hawkey",
  "instrument": "Songs",
  "bio": [
    "Kimberly Hawkey is a multi-genre vocalist, instrumentalist and bandleader based in the Catskill mountains of New York. Evoking a sweet sense of swing and indefatigable stage presence, Kimberly has been described as 'a delightfully fresh-voiced treat' (BroadwayWorld.com), with 'exceptional musicality and one fun surprise after another' (Cabaret Scenes). Kimberly sings with the top trad jazz and swing bands in NYC and has performed in well-known venues as both a soloist and collaborator. She is the recipient of the Johnny Mercer Award, the American Traditions Vocal Competition Gold Medal and is a 2x winner of NYC's Cabaret Showdown. Kimberly has garnered attention for developing and producing thematic concerts under her growing brand, Elvanelle Music. In 2018 She created and performed with 'The Elvanelle Orchestra: Song of the Catskills' - a 9-piece show band honoring the tradition of Catskill mountain entertainment during the Grand Hotel era. She is the bandleader of The Swingaroos, which has enjoyed sold-out runs and has been called 'awesome in every way' and 'one of the most entertaining shows you will see' (Broadwayworld.com). She has performed at Birdland Jazz Club, The Iridium, Caramoor, Hilton Head Symphony Orchestra, The Plaza Hotel among other notable venues. Kimberly has been teaching music for over 10 years and conducts jazz and vocal workshops in schools across the country. She has recorded and produced two albums as a bandleader."
  ],
  "links": [
    {
      "text": "Kimbery's Website",
      "link": "https://www.kimberlyhawkey.com/"
    },
    {
      "text": "Buy Kimberly's Album",
      "link": "https://www.kimberlyhawkey.com/album"
    },
    {
      "text": "Buy the Swingaroos album",
      "link": "https://theswingaroos.bandcamp.com/album/music-of-the-night"
    },
    {
      "text": "Receive Updates on Kimberly's upcoming album",
      "link": "https://bit.ly/2IYquSM"
    }
  ],
  "payment": {
    "venmo": "./kim_hawkey.png",
    "paypal": ""
  },
  "charity": {
    "name": "Mental Health America",
    "bio": [
      "Mental Health America understands that racism undermines mental health. Therefore, we are committed to anti-racism in all that we do. This means that we pledge to work against individual racism, interpersonal racism, and institutional racism in all their forms. Mental Health America is the nation's leading community-based nonprofit dedicated to addressing the needs of those living with mental illness and to promoting the overall mental health of all."
    ],
    "link": "Mental Health America"
  }
}
