{
  "date": "10/22/2020",
  "code": "4mY6I9LCAcI",
  "number": 20,
  "location": "L.A.",
  "name": "Polartropica",
  "instrument": "Pop/Panda",
  "bio": [
    "POLARTROPICA is the unconventionally alluring music endeavor of Los Angeles-based galactic dream pop artist.  Recently crowned LA Weekly's Best Indie Pop Band, Polartropica has created a genre of ethereal synth psychedelia that you've never heard before - combining exquisite melodies, dreamlike classical string arrangements, and shimmering vocals.  Polartropica's accclaimed debut EP 'Astrodreams' was released on Lolipop Records.  Post US Tour and residency at the Bootleg Theater in Los Angeles this past year, Polartropica released their first full-length LP ‘Dreams Come True’ in March of 2020 and continues to rock the airwaves with glitter prog dream rock that will take you to another galaxy!",
    "'Ihui Cherise Wu spins such enchanting, sparkling sounds with her band Polartropica that it’s easy to assume she’s a mere electro-pop escapist, albeit one with a glamorous, glittery onstage style that makes her resemble a space-age fairy-tale princess who’s fallen to Earth.” - LA Weekly'"
  ],
  "links": [
    {
      "text": "Buy the POLARTROPICA Vinyl",
      "link": "https://polartropica.bandcamp.com/album/dreams-come-true"
    },
    {
      "text": "Latest Polartropica video on Billboard",
      "link": "https://www.billboard.com/articles/news/pride/8524619/polartropica-in-another-life-video"
    },
    {
      "text": "Polartropica on Facebook",
      "link": "www.instagram.com/polartropica"
    },
    {
      "text": "Polartropica on Soundcloud",
      "link": "www.soundcloud.com/polartropica"
    },
    {
      "text": "Polartropica on Spotify",
      "link": "https://open.spotify.com/artist/594UCPHorID2NPzhboCuWl?si=FgUkZ19QSgec54AiUGUp6g"
    }
  ],
  "payment": {
    "venmo": "./polartropica.png",
    "paypal": ""
  },
  "charity": {
    "name": "Trans Defense Fund La",
    "bio": [
      "[Providing self-defense kits to trans folx, femmes + sex workers in Los Angeles]"
    ],
    "link": "linktr.ee/Transdefensefundla"
  }
}
