{
  "date": "11/5/2020",
  "location": "NYC",
  "name": "Tomoko Omura",
  "instrument": "Violin",
  "bio": [
    "Tomoko Omura is a jazz violinist/composer currently living in Brooklyn, NY with her son and her partner, Glenn Zaleski. While being a part of numerous jazz projects in New York, she leads her own groups and is an active performer internationally. She has released four albums as a leader, including the latest “Branches Vol. 1” (2020), which is a follow-up to her 2nd album “Roots” (2015). Her 'Roots project' is dedicated to write compositions/arrangements that are inspired by her roots, Japanese culture.",

    "Originally from Shizuoka, Japan, she began playing the violin at 4 and fell in love with jazz in her teens. She self-taught jazz on the violin since the age of 18 and moved to the U.S. to study at Berklee College of Music in 2004 and relocated to NY in 2010 to dive into the jazz world.",

    "She has been listed as Rising Star violinist on Downbeat Magazine, critics poll for the last consecutive years since 2015. The latest “Branches Vol. 1” has been receiving positive reviews from the critics and Jazz Times called her “A real genius” for her compositions. She was a semi-finalist at the 1st Zbigniew Seifert International Jazz Violin Competition in Krakow, Poland in 2014."
  ],
  "links": [
    {
      "text": "Tomoko's Website",
      "link": "http://www.tomokoomura.com/"
    },
    {
      "text": "new album 'Branches Vol. 1' on bandcamp:",
      "link": "https://tomokoomura.bandcamp.com/album/branches-vol-1"
    }
  ],
  "payment": {
    "venmo": "./tomoko_omura.png",
    "paypal": ""
  },
  "charity": {
    "name": "National Domestic Violence Hotline",
    "bio": [
      "24 hours a day, seven days a week, 365 days a year, the National Domestic Violence Hotline provides essential tools and support to help survivors of domestic violence so they can live their lives free of abuse.",
      "Contacts to The Hotline can expect highly-trained, expert advocates to offer free, confidential, and compassionate support, crisis intervention information, education, and referral services in over 200 languages."
    ],

    "link": "https://www.thehotline.org/"
  }
}
